In [3]:
import pandas as pd
df = pd.read_excel("students.xlsx")

In [4]:
pd

In [5]:
df=pd.read_excel("students.xlsx")

In [6]:
df

    Name  Age  Marks
0   John   20     85
1  Alice   22     90
2    Bob   21     78
3   Sara   23     92

In [15]:
top_stud=df[df['Marks']>89][['Name','Age']]
top_stud

    Name  Age
1  Alice   22
3   Sara   23

In [16]:
top_stud.to_excel('top_stud.xlsx',index=False)
print('filtered data saved to top_stud.xlsx')

filtered data saved to top_stud.xlsx